case/outputs_steady/openfoam_cases/section_1_x27p2km/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (-0.0269938 -0.0269938 0)
    (0.0269938 -0.0269938 0)
    (0.0269938 0.0269938 0)
    (-0.0269938 0.0269938 0)
    (-0.0539876 -0.0539876 0)
    (0.0539876 -0.0539876 0)
    (0.0539876 0.0539876 0)
    (-0.0539876 0.0539876 0)
    (-0.0269938 -0.0269938 1.8324)
    (0.0269938 -0.0269938 1.8324)
    (0.0269938 0.0269938 1.8324)
    (-0.0269938 0.0269938 1.8324)
    (-0.0539876 -0.0539876 1.8324)
    (0.0539876 -0.0539876 1.8324)
    (0.0539876 0.0539876 1.8324)
    (-0.0539876 0.0539876 1.8324)
);

blocks
(
    hex (0 1 2 3 8 9 10 11) (10 10 40) simpleGrading (1 1 1)
    hex (4 5 1 0 12 13 9 8) (10 10 40) simpleGrading (1 1 1)
    hex (5 6 2 1 13 14 10 9) (10 10 40) simpleGrading (1 1 1)
    hex (6 7 3 2 14 15 11 10) (10 10 40) simpleGrading (1 1 1)
    hex (7 4 0 3 15 12 8 11) (10 10 40) simpleGrading (1 1 1)
);

edges
(
    arc 4 5 (0 -0.07635 0)
    arc 5 6 (0.07635 0 0)
    arc 6 7 (0 0.07635 0)
    arc 7 4 (-0.07635 0 0)
    arc 12 13 (0 -0.07635 1.8324)
    arc 13 14 (0.07635 0 1.8324)
    arc 14 15 (0 0.07635 1.8324)
    arc 15 12 (-0.07635 0 1.8324)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (4 5 1 0)
            (5 6 2 1)
            (6 7 3 2)
            (7 4 0 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 10 11)
            (12 13 9 8)
            (13 14 10 9)
            (14 15 11 10)
            (15 12 8 11)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 4 12 15)
        );
    }
);

mergePatchPairs ();
